# MullionProfileContainsMoreThanOneOrOpenLoop Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainGridFamilyFailures..::..MullionProfileContainsMoreThanOneOrOpenLoop Property
BuiltInFailures..::..CurtainGridFamilyFailures Class See Also
---
The selected mullion profile either contains more than one profile loop or an open profile loop and cannot be used. Valid profiles can only have a single continuous closed profile loop.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MullionProfileContainsMoreThanOneOrOpenLoop { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MullionProfileContainsMoreThanOneOrOpenLoop As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MullionProfileContainsMoreThanOneOrOpenLoop {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace